In [1]:
import pandas as pd

In [6]:
df = pd.read_json('emp_src.json')

In [7]:
df

   eno   ename  deptno
0    1  Thomas      10
1    2  Pankaj      10
2    3     Ali      20
3    4  Mayank      10

In [9]:
df = pd.read_csv('emp_tgt.csv')

In [10]:
df

   eno   ename  deptno
0    1  Thomas      10
1    2  Pankaj      10
2    3     Ali      20
3    4  Mayank      10

In [12]:
import pytest
import pandas as pd
from sqlalchemy import create_engine
oracle_engine = create_engine("oracle+cx_oracle://system:admin@localhost:1521/xe")
mysql_engine = create_engine("mysql+pymysql://root:Admin%40143@localhost:3308/etlautomation")

In [16]:
query_src = """select id,name from city order by id"""
query_tgt = """select id,name from city order by id"""
df_src = pd.read_sql(query_src, oracle_engine)
df_tgt = pd.read_sql(query_tgt, mysql_engine)

In [17]:
df_src

     id       name
0     1      Delhi
1     2  Bangalore
2     3       Pune
3     4     Mumbai
4     8        Goa
5     9     Kanpur
6    11       Pune
7   100    Kolkata
8   101     Indore
9   110     Jaipur
10  120     Bhopal

In [18]:
df_tgt

    id       name
0    1      Delhi
1    2  Bangalore
2    3       Pune
3    4     Mumbai
4    8        Goa
5    9     Kanpur
6   11       Pune
7  100    Kolkata
8  101     Indore

In [19]:
df_tgt['id'].isin(df_src['id'])

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
Name: id, dtype: bool

In [22]:
df_src[~df_src['id'].isin(df_tgt['id'])]

     id    name
9   110  Jaipur
10  120  Bhopal

In [23]:
query_tgt = """select * from city_duplicate"""
df_tgt = pd.read_sql(query_tgt, mysql_engine)

In [26]:
df_tgt

   id       name
0   1       Pune
1   1       Pune
2   1       Pune
3   1       Pune
4   2  Bnagalore
5   2  Bnagalore
6   3  Hyderabad

In [28]:
df_tgt.duplicated().sum()

4

In [29]:
assert df_tgt.duplicated().sum() == 0,"There are duplicated please check"

AssertionError: There are duplicated please check

In [30]:
df_tgt[df_tgt.duplicated()]

   id       name
1   1       Pune
2   1       Pune
3   1       Pune
5   2  Bnagalore

In [32]:
query_src = """select count(*) from city """
query_tgt = """select count(*) from city """
df_src = pd.read_sql(query_src, oracle_engine).iloc[0,0]
df_tgt = pd.read_sql(query_tgt, mysql_engine).iloc[0,0]

In [33]:
df_src

   COUNT(*)
0        11

In [36]:
df_src.iloc[0,0]

11